In [146]:
import pandas as pd
import numpy as np

In [147]:
df=pd.read_csv("Index2018.csv")

In [148]:
df

            date          spx       dax         ftse    nikkei
0     07/01/1994   469.900000   2224.95  3445.980000  18124.01
1     10/01/1994   475.270000   2225.00  3440.580000  18443.44
2     11/01/1994   474.130000   2228.10  3413.770000  18485.25
3     12/01/1994   474.170000   2182.06  3372.020000  18793.88
4     13/01/1994   472.470000   2142.37  3360.010000  18577.26
...          ...          ...       ...          ...       ...
6264  23/01/2018  2839.130362  13559.60  7731.827774  24124.15
6265  24/01/2018  2837.544008  13414.74  7643.428966  23940.78
6266  25/01/2018  2839.253031  13298.36  7615.839954  23669.49
6267  26/01/2018  2872.867839  13340.17  7665.541292  23631.88
6268  29/01/2018  2853.528411  13324.48  7671.533300  23629.34

[6269 rows x 5 columns]

In [149]:
df.date.describe()

count           6269
unique          6269
top       07/01/1994
freq               1
Name: date, dtype: object

## transforming Date column into a date type

In [150]:
df.date = pd.to_datetime(df.date, dayfirst = True)

In [151]:
df.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [152]:
df.date.describe()

C:\Users\Asnate\AppData\Local\Temp\ipykernel_20544\1371252037.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df.date.describe()

count                    6269
unique                   6269
top       1994-01-07 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

 ## how to set any attribute of a data frame as an idex

In [153]:
df.set_index("date", inplace=True)

In [154]:
df.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

## Setting the desired frequency, a, m, w, d, h. b, using asfreq

In [155]:
df=df.asfreq('d')

In [156]:
df.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25

## the NaN indicates that those date do not have any attributes...remember, those dates were not part of the original 
## dates...we generated them, when dates were used as Index, instead of the original index. it could also be that, the original 
## data avoided weekends, and dealt with only business days...in this case, b-business day, could be used.

In [157]:
df=df.asfreq('b')

In [158]:
df.head(10)

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26
1994-01-14  474.91  2151.05  3400.56  18973.70
1994-01-17  473.30  2115.56  3407.83  18725.37
1994-01-18  474.25  2130.35  3437.01  18514.55
1994-01-19  474.30  2132.52  3475.15  19039.40
1994-01-20  474.98  2098.36  3469.99  19183.92

# Missing Values

In [159]:
df.isna()

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
1994-01-12  False  False  False   False
1994-01-13  False  False  False   False
...           ...    ...    ...     ...
2018-01-23  False  False  False   False
2018-01-24  False  False  False   False
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-29  False  False  False   False

[6277 rows x 4 columns]

# True indicates a missing value, False indicates no missing values

# to determine the number of instances without available information

In [160]:
df.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

## so, 8 each of the instances has no available information...so setting the## data frequency to business days, must have generated 8 dates for which we ## have no available data

##  How to fill in the missing values, with fillna() method

## 1) Front Filling...where we assign the value of the previous period

## 2) Back filling...we assign the value of the next period

## 3) assign the same value for all missing periods...usually, we assign the average of the time series, to the missing  values, especially when data is normally distributed

## Front filling the spx data

In [163]:
df.spx=df.spx.fillna(method="ffill")

In [164]:
df.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

## spx has 0 missing values now

In [165]:
df.ftse=df.ftse.fillna(method="bfill")

In [166]:
df.isna().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [167]:
df.dax=df.dax.fillna(value=df.dax.mean())

In [168]:
df.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [170]:
df.nikkei=df.nikkei.fillna(value=df.nikkei.mean())

In [171]:
df.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

## Adding and deleting columns

In [172]:
## Adding a column "Market_Values"...and assigning spx values to it

In [173]:
df['Market_Value']=df.spx

In [175]:
df.describe()

               spx           dax         ftse        nikkei  Market_Value
count  6277.000000   6277.000000  6277.000000   6277.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.055700   1288.642547
std     487.868210   2752.604984  1145.568370   4040.545253    487.868210
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     992.715221   4070.460000  4487.880000  10711.090000    992.715221
50%    1233.761241   5774.380000  5663.300000  15014.040000   1233.761241
75%    1460.250000   7442.660000  6304.630175  17858.420000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

In [176]:
## Dropping Market_Value

In [177]:
del df["Market_Value"]

In [178]:
df.describe()

               spx           dax         ftse        nikkei
count  6277.000000   6277.000000  6277.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.055700
std     487.868210   2752.604984  1145.568370   4040.545253
min     438.920000   1911.700000  2876.600000   7054.980000
25%     992.715221   4070.460000  4487.880000  10711.090000
50%    1233.761241   5774.380000  5663.300000  15014.040000
75%    1460.250000   7442.660000  6304.630175  17858.420000
max    2872.867839  13559.600000  7778.637689  24124.150000

In [180]:
## to delete a list of columns

# del df["a"], df["b"], df["c"]

## Splitting up Data

In [181]:
## using 80% of data

In [182]:
size=int(len(df)*0.8)

In [ ]:
df=df.iloc[:size]

In [184]:
df_test=df.iloc[size: ]

In [188]:
df.tail()

                    spx       dax         ftse    nikkei
date
2018-01-23  2839.130362  13559.60  7731.827774  24124.15
2018-01-24  2837.544008  13414.74  7643.428966  23940.78
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

In [189]:
df_test.head()

                    spx      dax     ftse    nikkei
date
2013-04-08  1563.071269  7662.64  6276.94  13192.59
2013-04-09  1568.607909  7637.51  6313.20  13192.35
2013-04-10  1587.731827  7810.63  6387.37  13288.13
2013-04-11  1593.369863  7871.63  6416.14  13549.16
2013-04-12  1588.854623  7744.77  6384.39  13485.14